; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 94)
	(= (value c1) 58)
	(= (value c2) 52)
	(= (value c3) 44)
	(= (value c4) 80)
	(= (value c5) 12)
	(= (value c6) 21)
	(= (value c7) 85)
	(= (value c8) 84)
	(= (value c9) 37)
	(= (value c10) 52)
	(= (value c11) 75)
	(= (value c12) 37)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 12
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 12
3. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 5 of 12
4. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 5 of 12
5. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 5 of 12
6. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 5 of 12
7. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 5 of 12
8. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 5 of 12
9. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 5 of 12
10. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 12
11. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 12
12. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 12
13. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 5 of 12
14. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 5 of 12
15. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 5 of 12
16. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 5 of 12
17. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 5 of 12
18. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 5 of 12
19. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 5 of 12
20. (increment c8)
   changed: (value c8) from 84 to 88
   goals met: 6 of 12
21. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 6 of 12
22. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 6 of 12
23. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 12
24. (increment c3)
   changed: (value c3) from 44 to 49
   goals met: 6 of 12
25. (increment c3)
   changed: (value c3) from 49 to 54
   goals met: 7 of 12
26. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 12
27. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 12
28. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 12
29. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 7 of 12
30. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 7 of 12
31. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 12
32. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 7 of 12
33. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 7 of 12
34. (increment c1)
   changed: (value c1) from 58 to 64
   goals met: 7 of 12
35. (increment c1)
   changed: (value c1) from 64 to 70
   goals met: 7 of 12
36. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 7 of 12
37. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 7 of 12
38. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 7 of 12
39. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 7 of 12
40. (increment c12)
   changed: (value c12) from 37 to 45
   goals met: 7 of 12
41. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 12
42. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 12
43. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 7 of 12
44. (increment c12)
   changed: (value c12) from 45 to 54
   goals met: 7 of 12
45. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 7 of 12
46. (increment c12)
   changed: (value c12) from 54 to 64
   goals met: 7 of 12
47. (increment c12)
   changed: (value c12) from 64 to 74
   goals met: 7 of 12
48. (increment c12)
   changed: (value c12) from 74 to 84
   goals met: 8 of 12
49. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 8 of 12
50. (increment c9)
   changed: (value c9) from 37 to 44
   goals met: 8 of 12
51. (increment c9)
   changed: (value c9) from 44 to 51
   goals met: 8 of 12
52. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 8 of 12
53. (increment c9)
   changed: (value c9) from 51 to 59
   goals met: 7 of 12
54. (decrement c8)
   changed: (value c8) from 88 to 84
   goals met: 6 of 12
55. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 6 of 12
56. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 6 of 12
57. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 6 of 12
58. (increment c8)
   changed: (value c8) from 84 to 89
   goals met: 7 of 12
59. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 7 of 12
60. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 12
61. (decrement c1)
   changed: (value c1) from 70 to 62
   goals met: 7 of 12
62. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 12
63. (increment c1)
   changed: (value c1) from 62 to 71
   goals met: 7 of 12
64. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 7 of 12
65. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 12
66. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 7 of 12
67. (increment c2)
   changed: (value c2) from 52 to 57
   goals met: 6 of 12
68. (increment c3)
   changed: (value c3) from 54 to 59
   goals met: 7 of 12
69. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 12
70. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 12
71. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 12
72. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 12
73. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 12
74. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 12
75. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 7 of 12
76. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 12
77. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 7 of 12
78. (increment c5)
   changed: (value c5) from 12 to 21
   goals met: 6 of 12
79. (increment c5)
   changed: (value c5) from 21 to 30
   goals met: 6 of 12
80. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 12
81. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 12
82. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 12
83. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 12
84. (increment c5)
   changed: (value c5) from 30 to 39
   goals met: 6 of 12
85. (increment c6)
   changed: (value c6) from 21 to 22
   goals met: 6 of 12
86. (decrement c5)
   changed: (value c5) from 39 to 30
   goals met: 6 of 12
87. (decrement c5)
   changed: (value c5) from 30 to 21
   goals met: 7 of 12
88. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 12
89. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 12
90. (increment c5)
   changed: (value c5) from 21 to 31
   goals met: 6 of 12
91. (decrement c4)
   changed: (value c4) from 80 to 76
   goals met: 6 of 12
92. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 12
93. (increment c5)
   changed: (value c5) from 31 to 41
   goals met: 6 of 12
94. (decrement c4)
   changed: (value c4) from 76 to 71
   goals met: 6 of 12
95. (increment c5)
   changed: (value c5) from 41 to 51
   goals met: 6 of 12
96. (decrement_rate c6)
   changed: (rate_value c6) from 1 to 0
   goals met: 6 of 12
97. (decrement c5)
   changed: (value c5) from 51 to 41
   goals met: 6 of 12
98. (decrement c5)
   changed: (value c5) from 41 to 31
   goals met: 6 of 12
99. (decrement c4)
   changed: (value c4) from 71 to 66
   goals met: 6 of 12
100. (decrement c4)
   changed: (value c4) from 66 to 61
   goals met: 6 of 12
101. (increment c2)
   changed: (value c2) from 57 to 62
   goals met: 5 of 12
102. (increment c2)
   changed: (value c2) from 62 to 67
   goals met: 5 of 12
103. (increment c1)
   changed: (value c1) from 71 to 81
   goals met: 5 of 12
104. (decrement c0)
   changed: (value c0) from 94 to 92
   goals met: 5 of 12
105. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 5 of 12
106. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 5 of 12
107. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 5 of 12
108. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 5 of 12
109. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 5 of 12
110. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 5 of 12
111. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 5 of 12
112. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 5 of 12
113. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 5 of 12
114. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 5 of 12
115. (increment c1)
   changed: (value c1) from 81 to 91
   goals met: 5 of 12
116. (decrement c2)
   changed: (value c2) from 67 to 62
   goals met: 5 of 12
117. (decrement c2)
   changed: (value c2) from 62 to 57
   goals met: 6 of 12
118. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 6 of 12
119. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 6 of 12
120. (decrement c0)
   changed: (value c0) from 92 to 90
   goals met: 7 of 12
121. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 7 of 12
122. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 7 of 12
123. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 7 of 12
124. (decrement c8)
   changed: (value c8) from 89 to 79
   goals met: 6 of 12
125. (decrement c8)
   changed: (value c8) from 79 to 69
   goals met: 6 of 12
126. (decrement c8)
   changed: (value c8) from 69 to 59
   goals met: 6 of 12
127. (decrement_rate c8)
   changed: (rate_value c8) from 10 to 9
   goals met: 6 of 12
128. (increment c8)
   changed: (value c8) from 59 to 68
   goals met: 6 of 12
129. (increment c8)
   changed: (value c8) from 68 to 77
   goals met: 6 of 12
130. (increment c9)
   changed: (value c9) from 59 to 69
   goals met: 6 of 12
131. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 6 of 12
132. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 6 of 12
133. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 6 of 12
134. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 6 of 12
135. (increment c10)
   changed: (value c10) from 52 to 56
   goals met: 6 of 12
136. (increment c10)
   changed: (value c10) from 56 to 60
   goals met: 6 of 12
137. (increment c10)
   changed: (value c10) from 60 to 64
   goals met: 6 of 12
138. (increment c10)
   changed: (value c10) from 64 to 68
   goals met: 6 of 12
139. (increment c10)
   changed: (value c10) from 68 to 72
   goals met: 7 of 12
140. (increment c8)
   changed: (value c8) from 77 to 86
   goals met: 8 of 12
141. (increment c9)
   changed: (value c9) from 69 to 79
   goals met: 7 of 12
142. (increment c10)
   changed: (value c10) from 72 to 76
   goals met: 6 of 12
143. (increment c11)
   changed: (value c11) from 75 to 77
   goals met: 7 of 12
144. (increment c10)
   changed: (value c10) from 76 to 80
   goals met: 7 of 12
145. (increment c11)
   changed: (value c11) from 77 to 79
   goals met: 7 of 12
146. (increment c11)
   changed: (value c11) from 79 to 81
   goals met: 8 of 12
147. (decrement c8)
   changed: (value c8) from 86 to 77
   goals met: 8 of 12
148. (increment c5)
   changed: (value c5) from 31 to 41
   goals met: 8 of 12
149. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 8 of 12
150. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 8 of 12
151. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 8 of 12
152. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 8 of 12
153. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 8 of 12
154. (increment c6)
   changed: (value c6) from 22 to 27
   goals met: 8 of 12
155. (increment c6)
   changed: (value c6) from 27 to 32
   goals met: 8 of 12
156. (increment c6)
   changed: (value c6) from 32 to 37
   goals met: 8 of 12
157. (increment c6)
   changed: (value c6) from 37 to 42
   goals met: 9 of 12
158. (increment c5)
   changed: (value c5) from 41 to 51
   goals met: 8 of 12
159. (increment c6)
   changed: (value c6) from 42 to 47
   goals met: 8 of 12
160. (increment c6)
   changed: (value c6) from 47 to 52
   goals met: 9 of 12
161. (increment c5)
   changed: (value c5) from 51 to 61
   goals met: 8 of 12
162. (increment c6)
   changed: (value c6) from 52 to 57
   goals met: 8 of 12
163. (increment c6)
   changed: (value c6) from 57 to 62
   goals met: 9 of 12
164. (increment c5)
   changed: (value c5) from 61 to 71
   goals met: 9 of 12
165. (increment c6)
   changed: (value c6) from 62 to 67
   goals met: 9 of 12
166. (increment c6)
   changed: (value c6) from 67 to 72
   goals met: 10 of 12
167. (decrement c1)
   changed: (value c1) from 91 to 81
   goals met: 9 of 12
168. (decrement c1)
   changed: (value c1) from 81 to 71
   goals met: 9 of 12
169. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 9 of 12
170. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 9 of 12
171. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 9 of 12
172. (decrement c0)
   changed: (value c0) from 90 to 85
   goals met: 9 of 12
173. (decrement c0)
   changed: (value c0) from 85 to 80
   goals met: 9 of 12
174. (decrement c0)
   changed: (value c0) from 80 to 75
   goals met: 9 of 12
175. (decrement c0)
   changed: (value c0) from 75 to 70
   goals met: 10 of 12
176. (decrement c1)
   changed: (value c1) from 71 to 61
   goals met: 9 of 12
177. (decrement c1)
   changed: (value c1) from 61 to 51
   goals met: 10 of 12
178. (decrement c0)
   changed: (value c0) from 70 to 65
   goals met: 10 of 12
179. (decrement c0)
   changed: (value c0) from 65 to 60
   goals met: 10 of 12
180. (decrement c0)
   changed: (value c0) from 60 to 55
   goals met: 10 of 12
181. (decrement c0)
   changed: (value c0) from 55 to 50
   goals met: 11 of 12
182. (increment c8)
   changed: (value c8) from 77 to 86
   goals met: 11 of 12
183. (increment c9)
   changed: (value c9) from 79 to 89
   goals met: 11 of 12
184. (increment c10)
   changed: (value c10) from 80 to 84
   goals met: 10 of 12
185. (increment c10)
   changed: (value c10) from 84 to 88
   goals met: 10 of 12
186. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 10 of 12
187. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 10 of 12
188. (increment c11)
   changed: (value c11) from 81 to 85
   goals met: 9 of 12
189. (increment c12)
   changed: (value c12) from 84 to 94
   goals met: 10 of 12
190. (increment c11)
   changed: (value c11) from 85 to 89
   goals met: 11 of 12
191. (increment c10)
   changed: (value c10) from 88 to 92
   goals met: 11 of 12
192. (increment c11)
   changed: (value c11) from 89 to 93
   goals met: 12 of 12
